resources/templates/telusapis/customer_Provide8.xml

 <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://ossj.org/xml/Common/v1-5"> <soapenv:Header/> <soapenv:Body> <v1:genericNCIntegrationOperation> <v1:item> <v1:CharacteristicValue> <v1:Value>success</v1:Value> <v1:Characteristic>status</v1:Characteristic> </v1:CharacteristicValue> <v1:CharacteristicValue> <v1:Value>1820002156</v1:Value> <v1:Characteristic>Order Number</v1:Characteristic> </v1:CharacteristicValue> <v1:CharacteristicValue> <v1:Value>539459352A</v1:Value> <v1:Characteristic>Tracking Number</v1:Characteristic> </v1:CharacteristicValue> <v1:CharacteristicValue> <v1:Value>09/10/2020</v1:Value> <v1:Characteristic>Expected Delivery Date</v1:Characteristic> </v1:CharacteristicValue> <v1:CharacteristicValue> <v1:Value>9158257863013172781</v1:Value> <v1:Characteristic>Purchase Order Number</v1:Characteristic> </v1:CharacteristicValue> <v1:CharacteristicValue> <v1:Value>CANADA POST</v1:Value>  <v1:Characteristic>Shipper</v1:Characteristic> </v1:CharacteristicValue> <v1:CharacteristicValue> <v1:Value>notifystatus</v1:Value> <v1:Characteristic>operation name</v1:Characteristic> </v1:CharacteristicValue> <v1:CharacteristicValue> <v1:Value>logistics</v1:Value> <v1:Characteristic>notification type</v1:Characteristic> </v1:CharacteristicValue> </v1:item> </v1:genericNCIntegrationOperation> </soapenv:Body> </soapenv:Envelope>